tutorials/combustion/reactingFoam/BYOG_SLGPS/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeEtc "caseDicts/solvers/chemistry/TDAC/chemistryProperties.cfg"

chemistryType
{
    solver            ode;
    method            TDAC;
}

chemistry       on;

initialChemicalTimeStep 1e-7;
//maxChemicalTimeStep 1e-3;

odeCoeffs
{
    solver          seulex;
    absTol          1e-8;
    relTol          1e-1;
}

reduction
{
    tolerance   1e-4;
    method      GPS_ML_Simult;
}

tabulation
{
    tolerance   3e-3;
}

TDACCoeffs
{
    graphPath           "./model_EXTRA_PROD_a_0.00000000000075_l_16.pb";
    inputLayerName      "dense_2_input";
    outputLayerName     "dense_3/Sigmoid";

    // Indices in this mechanism's species order, remapped from the
    // standard GRI-3.0 training order
    // always: H O O2 OH H2O HO2 H2O2 CH4 CO2 CH2O NNH N2; never: AR
    alwaysIncludedSpecies    (3 6 4 7 8 9 10 0 17 1 34 47);
    neverIncludedSpecies     (48);
    variablyIncludedSpecies
    (
        5 11 12 13 14 15 16 18 19 2 20 21 22 23 24 25 26 27 28 29
        30 31 32 33 35 36 37 38 39 40 41 42 43 44 45 46 49 50 51 52
    );
    // NN inputs: CH4 H2O OH H CO O2 CO2 O CH3 CH
    inputIndices             (0 8 7 3 16 4 17 6 15 12);
    inputMaxValues
    (
        2050.0 1.0
        0.25157232704402227 0.16594424796519067 0.020616671507983172
        0.02995083692452817 0.12241510069592972 0.20790020790020763
        0.07873180240865373 0.01777963214031066 0.010632139480001737
        6.506121535281325e-05
    );
    inputMinValues
    (
        290.0 1.0
        0.0 4.1275912666522404e-32 3.4510516978126006e-24
        9.310360588297054e-17 5.097113825829686e-39 0.0014552980509695756
        2.263388605568541e-39 6.024805233091142e-22 0.0
        0.0
    );
}

// ************************************************************************* //
